### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [2]:
# File to Load (Remember to Change These)
file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file)

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#Per Alexander's suggestion, we need to do an info of the Data Frame created
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
#Per Alexander's suggestion, we should always do a shape of the data frame
df.shape

(780, 7)

* Display the total number of players

In [5]:
#This is the total number of Players by Screen_Names (SN)
df.SN.nunique()

576

In [6]:
#Creating Summary of Total Number of Players
ttl_plyrs = df.SN.nunique()

Smmry1 = pd.DataFrame()
Smmry1["Total Players"] = [ttl_plyrs]

Smmry1

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
##Displaying data frame for Purchasing Analysis(Total)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [8]:
#Obtain number of unique items
df["Item ID"].nunique()

179

In [9]:
#Obtain Average Purchase Price.  
df.Price.mean()

3.050987179487176

In [10]:
#Obtain Total Revenue of Purchases
df.Price.sum()

2379.77

In [11]:
#Obtain the Total Number of Purchases
len(df)

780

In [12]:
df2 = df.copy()

In [13]:
#Display the summary dataframe with Total Revenue included
ttl_itms = df["Item ID"].nunique()
ttl_rws = len(df)
ttl_prc = df.Price.sum()
avg_prc = df.Price.mean()

#Styled the displayed data for cleaner formatting
df2 = pd.DataFrame()
df2["Number of of Unique Items"] = [ttl_itms]
df2["Number of Purchases"] = [ttl_rws]
df2["Average Price"] = [avg_prc]
df2["Total Revenue"] = [ttl_prc]

# Use Map to format all the columns
df2["Average Price"] = df2["Average Price"].map("${:.2f}".format)
df2["Total Revenue"] = df2["Total Revenue"].map("${:,}".format)

df2

   Number of of Unique Items  Number of Purchases Average Price Total Revenue
0                        179                  780         $3.05     $2,379.77

## Gender Demographics

In [14]:
#Displaying data frame for Gender Demogrpahics
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [15]:
#Count Players
cols = ["SN", "Age", "Gender"]

plyrs = df.loc[:, cols]
plyrs.head()

              SN  Age Gender
0        Lisim78   20   Male
1    Lisovynya38   40   Male
2     Ithergue48   24   Male
3  Chamassasya86   24   Male
4      Iskosia90   23   Male

In [16]:
#Dropping duplicates b/c one Screen_Name can make several purchases, result is 576 unique rows of data
plyrs = plyrs.drop_duplicates().reset_index(drop=True)
plyrs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SN      576 non-null    object
 1   Age     576 non-null    int64
 2   Gender  576 non-null    object
dtypes: int64(1), object(2)
memory usage: 13.6+ KB

In [17]:
#Count of Male & Female Players
#This sorts it by the VALUE
plyrs.Gender.value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [18]:
#Percentage of Male & Female Players
#This sorts it by the VALUE of percentages
plyrs.Gender.value_counts() / len(plyrs)

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [19]:
#Percentages of Males, Females & Other/Non-Disclosed
df3 = df2.copy
#Creating two columns (Total Count and % of Players) by GroupBy of Gender
#Note - Order here is by numerical value and not alphabetize, which is why Male row is top of the list becuase it has the higher values.
plyr_cnt = plyrs.Gender.value_counts()
plyr_prcnt = plyrs.Gender.value_counts() / len(plyrs)
# This is concatenating two series - Source: https://stackoverflow.com/a/18062521
df3 = pd.concat([plyr_cnt, plyr_prcnt], axis=1)
df3.columns = ["Total Count", 'Percentage of Players']

# Use Map to format all the columns
df3["Percentage of Players"] = df3["Percentage of Players"].map("{:.2%}".format)

df3

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [20]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
#Doing a groupby using the "agg" function per Alexander's suggestion - #Source:  https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.core.groupby.DataFrameGroupBy.agg.html
df.groupby("Gender").agg({"Purchase ID": "count", "Price": "mean"})

                       Purchase ID     Price
Gender
Female                         113  3.203009
Male                           652  3.017853
Other / Non-Disclosed           15  3.346000


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [23]:
df4 = df3.copy()

In [24]:
#Purchase Count, Average Purchase Price, Total Purchase Value broken down by Gender
#Create a summary data frame to hold the results
df4 = df.groupby("Gender").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df4.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]

df4

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [25]:
df4["Total Purchase Value"] / df3["Total Count"]

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [26]:
#Average Purchase Total per Person by Gender
df4["Average Total Purchase per Person"] = df4["Total Purchase Value"] / df3["Total Count"]
df4

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [27]:
df.groupby("Gender")["Purchase ID"].count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [28]:
#Percentages
counts = df.groupby("Gender")["Purchase ID"].count()
df.groupby("Gender")["Price"].mean()

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [29]:
counts = df.groupby("Gender")["Purchase ID"].count()
avrgs = df.groupby("Gender")["Price"].mean()
ttls = df.groupby("Gender")["Price"].sum()

pd.concat([counts, avrgs, ttls], axis=1)

                       Purchase ID     Price    Price
Gender
Female                         113  3.203009   361.94
Male                           652  3.017853  1967.64
Other / Non-Disclosed           15  3.346000    50.19

In [30]:
#Repeating for formatting purposes
#Display the summary data frame
df4 = df.groupby("Gender").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df4.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]

df4["Average Purchase Price"] = df4["Average Purchase Price"].map("${:.2}".format)
df4["Total Purchase Value"] = df4["Total Purchase Value"].map("${:,}".format)

df4

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,$3.2,$361.94
Male,652,$3.0,"$1,967.64"
Other / Non-Disclosed,15,$3.3,$50.190000000000005

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [31]:
#Creating bins to place values
bins = [0,9,14,19,24,29,34,9999999]

#Creating Labels for the Bins
group_labels = ["<10","10-14","15-19","20-24","25-29","30-34","40+"]

In [32]:
pd.cut(df.Age, bins, labels=group_labels, include_lowest=True)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (7, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '40+']

In [33]:
df["Age Group"] = pd.cut(df.Age, bins, labels=group_labels, include_lowest=True)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [34]:
df.groupby("Age Group").Age.max()

Age Group
<10       9
10-14    14
15-19    19
20-24    24
25-29    29
30-34    34
40+      45
Name: Age, dtype: int64

In [35]:
df.groupby("Age Group").Age.min()

Age Group
<10       7
10-14    10
15-19    15
20-24    20
25-29    25
30-34    30
40+      35
Name: Age, dtype: int64

In [36]:
cols = ["SN", "Age", "Gender", "Age Group"]

plyrs = df.loc[:, cols]
plyrs.head()

              SN  Age Gender Age Group
0        Lisim78   20   Male     20-24
1    Lisovynya38   40   Male       40+
2     Ithergue48   24   Male     20-24
3  Chamassasya86   24   Male     20-24
4      Iskosia90   23   Male     20-24

In [37]:
#Droppiing Duplicates
plyrs = plyrs.drop_duplicates().reset_index(drop=True)
plyrs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   SN         576 non-null    object
 1   Age        576 non-null    int64
 2   Gender     576 non-null    object
 3   Age Group  576 non-null    category
dtypes: category(1), int64(1), object(2)
memory usage: 14.5+ KB

In [38]:
df5 = df4.copy()

In [39]:
#Percentages
plyr_cnt = plyrs.groupby("Age Group").size()
plyr_prcnt = plyrs.groupby("Age Group").size() / len(plyrs)

# This is concatenating two series - Source: https://stackoverflow.com/a/18062521
df5 = pd.concat([plyr_cnt, plyr_prcnt], axis=1)
df5.columns = ["Total Count", 'Percentage of Players']

df5["Percentage of Players"] = df5["Percentage of Players"].map("{:.2%}".format)


df5

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
40+                 43                 7.47%

In [40]:
df6 = df5.copy()

In [41]:
df6 = df.groupby("Age Group").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df6.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]

df6

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
<10                    23                3.353478                 77.13
10-14                  28                2.956429                 82.78
15-19                 136                3.035956                412.89
20-24                 365                3.052219               1114.06
25-29                 101                2.900990                293.00
30-34                  73                2.931507                214.00
40+                    54                3.442778                185.91

In [42]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
#Create a summary data frame to hold the results
df6["Average Total Purchase per Person"] = df6["Total Purchase Value"] / df5["Total Count"]
df6

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
40+,54,3.442778,185.91,4.323488

In [43]:
#Repeating for formatting purposes
#Display the summary data frame
df6 = df.groupby("Age Group").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df6.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]

df6["Average Purchase Price"] = df6["Average Purchase Price"].map("${:.3}".format)
df6["Total Purchase Value"] = df6["Total Purchase Value"].map("${:,}".format)

df6

           Purchase Count Average Purchase Price Total Purchase Value
Age Group
<10                    23                  $3.35               $77.13
10-14                  28                  $2.96               $82.78
15-19                 136                  $3.04              $412.89
20-24                 365                  $3.05            $1,114.06
25-29                 101                   $2.9               $293.0
30-34                  73                  $2.93               $214.0
40+                    54                  $3.44              $185.91

In [44]:
df7 = df6.copy()

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [45]:
#Run basic calculations to obtain the results in the table below
#Create a summary data frame to hold the results
#Sort the total purchase value column in descending order
df7 = df.groupby("SN").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df7.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]
#Per Alexander's tutelage
df7.sort_values(by="Total Purchase Value", ascending=False, inplace=True)

df7.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [46]:
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame
df7 = df.groupby("SN").agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df7.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]
df7.sort_values(by="Total Purchase Value", ascending=False, inplace=True)


df7["Average Purchase Price"] = df7["Average Purchase Price"].map("${:.3}".format)
df7["Total Purchase Value"] = df7["Total Purchase Value"].map("${:,}".format)

df7.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.41  $13.620000000000001
Iskadarya95               3                  $4.37  $13.100000000000001

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [47]:
df8 = df7.copy()

In [48]:
#Retrieve the Item ID, Item Name, and Item Price columns
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value
#Create a summary data frame to hold the results
#Sort the purchase count column in descending order
df8 = df.groupby(["Item ID", "Item Name"]).agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df8.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]
df8.sort_values(by="Purchase Count", ascending=False, inplace=True)

df8.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [49]:
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame
df8 = df.groupby(["Item ID", "Item Name"]).agg({"Purchase ID": "count", "Price": ["mean", "sum"]})
df8.columns = ['Purchase Count', "Average Purchase Price", "Total Purchase Value"]
df8.sort_values(by="Purchase Count", ascending=False, inplace=True)

df8["Average Purchase Price"] = df8["Average Purchase Price"].map("${:.3}".format)
df8["Total Purchase Value"] = df8["Total Purchase Value"].map("${:,}".format)

df8.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.760000000000005
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [50]:
#Sort the above table by total purchase value in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the data frame
df8.sort_values(by="Total Purchase Value", ascending=False, inplace=True)
df8.head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,2,$4.99,$9.98
29,"Chaos, Ender of the End",5,$1.98,$9.9
173,Stormfury Longsword,2,$4.93,$9.86
38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48
143,Frenzied Scimitar,6,$1.56,$9.36